Revit 2027 API
BuiltInFailures.SketchFailures.CannotChangeUserSketchPlaneError Property
 Can't change plane of [Element Name] Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotChangeUserSketchPlaneError { get; }
Public Shared ReadOnly Property CannotChangeUserSketchPlaneError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotChangeUserSketchPlaneError {
	FailureDefinitionId^ get ();
}
static member CannotChangeUserSketchPlaneError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace